const creeds = [
  {
    title: 'Наше ставлення до Біблії',
    content: [
      'Ми віримо, що канонічні книги Старого і Нового Завітів є Словом Божим, єдиним і цілком достатнім для пізнання Бога і спасіння людини в кожну епоху і в кожному народі. Всі книги Біблії написані людьми, веденими Святим Духом (2 Петро. 1:21) і є богонатхненними та корисними для кожної людини (2 Тим. 3:16-17).',
      'Ми віримо, що Біблія (Слово Боже) - це абсолютна істина, єдине безпомилкове джерело християнської віри. Біблія відкриває нам істину про Бога – Отця, Сина Божого Ісуса Христа – Господа нашого, про Святого Духа, створення світу, створення Богом людини, про гріхопадіння і спасіння людини, про ангелів і диявола, про суд Божий і вічне життя.',
      'Бог сьогодні говорить через Біблію Святим Духом і діє відповідно до сказаного Ним Слова (Мт. 5:18, Іс. 55:11).',
    ],
  },
  {
    title: 'Бог',
    content: [],
    sections: [
      {
        subtitle: 'Триєдність Бога',
        content: [
          'Ми віримо в Єдиного праведного Бога, що виявляє Себе в трьох особах: Бог-Отець, Бог-Син, Бог-Дух Святий (Мт. 28:19, Бут. 1:26).',
        ],
      },
      {
        subtitle: 'Бог-Отець',
        content: [
          'Бог-Отець є Творцем усього видимого і невидимого (Дії. 17:24, Бут. 1:1-31), сущий на Небесах (Мт. 6:9), Всюдисущий (Пс. 138), Всезнаючий (Єр. 15:15), Всемогутній (Мт. 19:26), Незмінний (Ісх. 1:17), Святий (Іоан. 17:11), Праведний (Пс. 118:137-138) і Справедливий (Пс. 10:7). Бог є любов (1 Іоан. 4:16). Бог є Дух (Іоан. 4:24, 2 Кор. 3:17).',
          'Бог – Цілитель (Ісх. 15:26). Бог – Пастир (Пс. 22). Бог – милостивий (Євр. 8:12). Бог – Суддя Праведний (Бут. 18:25).',
        ],
      },
      {
        subtitle: 'Бог-Син',
        content: [
          'Ісус Христос є Бог (Рим. 9:5). Він єдиний з Отцем (Іоан. 14:9-10, Кол. 2:9). Народжений раніше всякого творіння (Кол. 1:15). Ним усе створено (Кол. 1:16). Ісус Христос, будучи Богом по суті, був зачатий Святим Духом у лоні Діви Марії, прийнявши людське тіло. Таким чином Бог став Людиною, що прийшов у плоті. Людина Ісус Христос – є образ невидимого Бога Отця (Іоан 1:18).',
          'Він був Сином Божим і Сином людським (Кол. 2:9). Прожив абсолютно безгрішне життя (Іоан. 14:30). Щоб врятувати людство від гріха, Він взяв на себе гріхи всіх людей і їхні хвороби (Іс. 53:1-11). Помер на хресті, і на третій день воскрес, щоб виправдати кожного, хто приходить через Нього до Бога (Іоан 3:16). Після Свого воскресіння – вознісся, і сів праворуч Бога-Отця, вище всякого начальства, і влади, і сили, і імені, що називається не тільки в цьому віці, але і в майбутньому, отримавши всю владу на небі і на землі (Еф. 1:20-23, Мт. 28:18).',
        ],
      },
      {
        subtitle: 'Бог-Дух Святий',
        content: [
          'Святий Дух – особа Святої Трійці, яка має всі Божі якості.',
          'Дух Святий є Бог (Дії 5:3-4). Дух Святий діяв на землі з часів творення (Бут. 1:2). Дух Святий живе у народженому згори – віруючій людині (1 Кор. 6:19). Дух Святий - Утішитель (Ін. 16:7). Дух Святий свідчить про Ісуса Христа (Ін. 15:26). Дух Святий вчить, докоряє і веде до покаяння, наставляє, відкриває істину, говорить про майбутнє, наділяє дарами народжених згори людей (1 Кор. 12).',
        ],
      },
    ],
  },
  {
    title: 'Людина',
    content: [
      'Ми віримо, що людина створена Богом за Його образом і подобою (Бут. 1:26-27). Людина створена моральною і вільною у виборі особистістю (Втор. 30:19). Людина рішенням власної волі порушила Божі накази, і впала в гріх, внаслідок чого були зруйновані її стосунки з Творцем. Вона втратила спілкування з Богом і успадкувала смерть (Рим. 5:12). Через викупну жертву Ісуса Христа людина отримала можливість позбутися гріха і духовної смерті (Ін. 3:16, Мт. 20:28).',
    ],
  },
  {
    title: 'Народження згори',
    content: [
      'Ми віримо, що для навернення грішника до Бога необхідна особиста віра людини у викупну жертву Ісуса Христа, що виникає в її серці через слухання Слова Божого і дію Святого Духа (Іоан. 16:8, Рим. 10:17, Євр. 11:6). Святий Дух через віру веде людину до покаяння, навернення від мертвих справ і спасіння в Ісусі Христі (Дії. 26:18, Еф. 2:8).',
      'Кров Ісуса Христа змиває гріхи і беззаконня, очищує порочну совість, відновлює стосунки і спілкування з Богом і є гарантом вічного життя (Євр. 9:14, Рим. 5:1).',
      'Наслідком навернення і особистого прийняття Ісуса Христа Спасителем є народження згори від Святого Духа і Слова Божого, як необхідна умова усиновлення і входження в Церкву Божу (Іоан. 1:12-13, 3:5, Яків. 1:18).',
    ],
    subtitle: 'Істинними ознаками народження згори є:',
    list: [
      'Публічне сповідання Ісуса Христа своїм Господом і Спасителем;',
      'Внутрішнє свідчення того, що людина має мир з Богом і є Його дитиною;',
      'Негативне ставлення до гріха;',
      'Любов до Бога і людей;',
      'Бажання внутрішніх змін;',
      'Бажання виконувати волю Божу і т.д. (Рим. 10:9, 1 Іоан. 3:14, Пс. 96:10, Рим. 12:2);',
      'Ми віримо, що людина рятується через щиру віру у викупну жертву Ісуса Христа, незалежно від конфесійної приналежності.',
    ],
  },
  {
    title: 'Церква',
    content: [
      'Ми віримо, що засновником Церкви є Ісус Христос (Мт. 16:18). Згідно з ученням Біблії існують Вселенська і помісні Церкви. Вселенська Церква вміщає в себе всі помісні Церкви.',
      'Вселенська, тобто всесвітня Церква Ісуса Христа складається з усіх народів, племен, мов, які викуплені і омивані кров’ю Ісуса Христа (Одкр. 5:9-10). Ми віримо, що всі, хто увірував у Христа і народжені згори – хрещені, тобто занурені Святим Духом в тіло Христове і є членами Церкви Христової (1 Кор. 12:13, Гал. 3:27-28). Ми віримо, що після закінчення періоду благодаті Церква Ісуса Христа буде взята з землі для зустрічі з Господом, щоб назавжди бути з Ним (1 Фес. 4:17, Фил. 3:20-21). Належність до Вселенської Церкви не звільняє від необхідності належати до помісної Церкви (Дії 2:41).',
      "Помісна Церква – це зібрання спасенних людей, об'єднаних однією вірою, єдиним ученням і бажанням спільно служити Господу (Дії. 2:42). Віруюча людина стає членом помісної Церкви згідно з правилами і порядками бажаної нею помісної громади.",
    ],
    subtitle: 'Завданнями помісної Церкви є:',
    list: [
      'йти по всьому світу, проповідуючи Євангеліє всьому творінню, виганяючи при цьому демонів, молячись на інших мовах і зцілюючи хворих (Мк. 16:16-18);',
      'хрещення всіх, хто увірував, і навчання їх учення Христа (Мт. 28:19);',
      'зміцнення єдності всіх християн згідно з Первосвященицькою молитвою Господа Ісуса Христа (Ін. 17:20-21);',
    ],
  },
  {
    title: 'Причастя',
    content: [
      'Ми віримо, що причастя є трапезою Нового Завіту в Крові Ісуса Христа (Мт. 26:26-28). Причастя є таїнством християнської віри, приєднанням до Тіла і Крові Ісуса Христа через хліб і вино, які споживаємо.',
      'Причастя можуть приймати народжені згори віруючі, які мають мир з Богом і людьми (1 Кор. 11:26-34)',
    ],
    subtitle: 'Причастя це:',
    list: [
      'Таїнство, встановлене Самим Господом Ісусом Христом;',
      'нагадування про сенс і мету Його смерті (вірш 24);',
      'заява нашої віри (вірш 26);',
      'наше духовне єднання з Господом, як Главою Тіла – Церкви;',
      'наше духовне єднання один з одним, як членів у Його Тілі.',
    ],
  },
  {
    title: 'Водне хрещення',
    content: [
      'Ми віримо, що хрещення у воді є заповіддю Ісуса Христа (Мр. 16:16, Мт. 28:19) і виконанням всієї правди Божої (Мт. 3:13-16). Також віримо, що водне хрещення повинно здійснюватися у свідомому віці, тому що це не обмивання тілесної нечистоти, а обіцянка Богу доброї совісті. Воно є зовнішнім символом внутрішнього посвячення (1 Петра 3:21).',
      'Сенсом водного хрещення є подоба смерті, поховання (занурення) віруючого для гріха і воскресіння (вихід з води) для нового, чистого життя у праведності Ісуса Христа (Рим. 6:2-5).',
      'Умовами водного хрещення є покаяння і віра у викупну жертву Ісуса Христа (Дії 2:38). Через водне хрещення людина не стає автоматично членом церкви, тому що вибір помісної Церкви – справа вільної волі хрещеного.',
    ],
  },
  {
    title: 'Хрещення Святим Духом',
    content: [
      'Ми віримо у хрещення Святим Духом зі знаменням говоріння на інших мовах (1 Кор. 14:5). Хрещення Святим Духом дає силу кожному віруючому бути свідком Ісуса Христа (Дії 1:8).',
      'Мета молитви на інших мовах – говорити Богові, а не людям (1 Кор. 14:2).',
      'Людина під час молитви на інших мовах усвідомлює свої дії, і керує ними, тобто сама вирішує – молитися їй на інших мовах чи на своїй – з розумінням (1 Кор. 14:14,15).',
      'Ми віримо, що Святий Дух співпрацює з людиною, а не поневолює її (Рим. 8:26). Молитва на інших мовах не має нічого спільного зі станом трансу чи гіпнозу, а є внутрішнім назиданням духу людини.',
    ],
  },
  {
    title: 'Молитва',
    content: [
      'Молитва – це спілкування людини з Богом (Єр. 33:3). Молитви бувають різними, особистими і громадськими (Мт. 6:6).',
    ],
  },
  {
    title: 'Духовні Дари',
    content: [
      'Ми віримо, що для створення Церкви Бог наділив віруючих дарами Святого Духа для повчання, втіхи, одкровення минулого, теперішнього і майбутнього, прояву Божої сили в зціленні хворих, у знаменнях і чудесах (Мр. 16:17-20, 1 Кор. 12:1-11).',
    ],
  },
  {
    title: 'Дари служінь',
    content: [
      'Ми віримо, що Бог поставляє в Церкві дари служіння: апостолів, пророків, євангелістів, пастирів, учителів, єпископів, пресвітерів, дияконів (Еф. 4:11-13, 1 Тим. 3:1-6, Тит.1:5, 1 Тим. 3:8-13).',
      'Вони є священнослужителями, які створюють Тіло Христове, вдосконалюють святих і готують членів Церкви до служіння.',
    ],
    subtitle: 'Порядок поставлення священнослужителів вимагає:',
    list: [
      'Покликання від Бога (Гал.1:1, Рим.1:1);',
      'Наявність необхідних якостей (1 Тим.3:1-7);',
      'Навчання і підготовки (1 Тим. 4:13-16);',
      'Рукопокладення старших священнослужителів (Дії 13:2,3).',
    ],
  },
  {
    title: 'Ангели',
    content: [
      'Ангели – духовні створіння, за силою та інтелектом перевершують людину.',
      'Диявол був переможений Ісусом Христом, позбавлений сили і влади (Євр. 2:14). Віруючим дана влада протистояти і виганяти його (Мрк. 16:17, 1 Пет. 5:8,9). Він діє в тих, хто противиться Богу і Його волі (Еф. 2:1-3). Кінцева участь диявола, демонів і богопротивників – вогняне озеро (Одкр. 20:10).',
    ],
    subtitle: 'Біблія ділить ангелів на 2 категорії:',
    list: [
      'Святі ангели, які посилаються Богом для служіння людям (Євр. 1:14, Мрк. 8:38, 1Тим. 5:21).',
      'Падші ангели - диявол, демони. Їх мета – губити (Юда 1:6, Іс. 14:12-15, Ів. 10:10).',
    ],
  },
  {
    title: 'Вознесіння Церкви і друге пришестя Ісуса Христа',
    content: [
      'Ми віримо, що відбудеться вознесіння церкви і друге пришестя Ісуса Христа (1 Фес. 4:16-17). Дати цієї події не дано знати нікому, крім Бога Отця (Мтф. 24:36).',
      'Ми віримо, що Ісус Христос прийде вдруге на землю в Єрусалим у великій славі і силі (Мтф. 25:31, Дії 1:11), щоб правити у Своєму Тисячолітньому Царстві (Одкр. 20:6). Диявол буде скутий на тисячу років (Одкр. 20:1-3).',
    ],
  },
  {
    title: 'Воскресіння мертвих і Божий суд',
    content: [
      'Ми віримо у воскресіння мертвих і Божий суд. Диявол, смерть, пекло і всі грішники, імена яких не записані в Книзі Життя, будуть кинуті в озеро вогняне навіки (Мт. 25:41, Одкр. 20:10,14-15).Ми віримо у воскресіння мертвих і Божий суд. Диявол, смерть, пекло і всі грішники, імена яких не записані в Книзі Життя, будуть кинуті в озеро вогняне навіки (Мт. 25:41, Одкр. 20:10,14-15).',
      'Сучасна земля і небо будуть знищені Богом (2 Петра 2:10).',
    ],
  },
  {
    title: 'Нове небо і нова земля',
    content: [
      'Ця земля і небо будуть знищені Богом (Одкр. 20:11).',
      'Ми очікуємо від Бога нове небо і нову землю (2 Пет 3:13, Одкр. 21:1-2). Церква і врятовані народи будуть вічно жити зі Христом на новій землі і новому небі, де Бог буде світлом, не буде зла і гріха, не буде сліз, хвороб і смерті (Одкр. 21:3-4).',
    ],
  },
  {
    title: "Сім'я і шлюб",
    content: [
      "Ми віримо, що інститут сім'ї встановлений Богом між чоловіком і жінкою ще до гріхопадіння людини (Бут. 2:18-24).",
      'У своїх правах чоловік і жінка рівні перед Богом і людьми.',
      "У сім'ї чоловік є головою дружини (1 Кор. 11:3). Дружина – помічниця чоловіка (Бут. 2:18) і співспадкоємиця благодатного життя (1 Петра 3:7). Діти слухаються батьків (Еф. 6:1-3).",
      'Шлюб – це добровільний союз між чоловіком і жінкою для спільного життя, любові, взаємної допомоги і продовження людського роду, доки смерть не розлучить їх (1 Кор. 7:39).',
      "Розлучення неприпустиме (Мтф. 19:6,9). У випадку подружньої невірності або фактичного залишення сім'ї одним із подружжя, невинна сторона має право на розлучення (1 Кор. 7:15, 1 Тим. 5:8, Мтф. 5:32).",
      'Церква благословляє і поєднує той добровільний союз між чоловіком і жінкою, який зареєстрований у відповідних державних органах (1 Пет. 2:13).',
      'Ми віримо, що діти – Боже благословення і батьки несуть відповідальність за всебічне їх виховання перед Богом і законами своєї країни (Еф. 6:1-4, Пс. 77:3-7).',
      'Ми віримо, що діти мають право на життя з моменту зачаття, тому аборт є гріхом перед Богом (Вих. 20:13).',
      'На підставі Біблії (Рим. 1:27-32, Лев. 20:13), здорового глузду і сімейних традицій нашого народу ми засуджуємо гріховну практику одностатевих сексуальних стосунків, і «одностатевих шлюбів», а також будь-які сексуальні стосунки поза шлюбом.',
    ],
  },
  {
    title: 'Ставлення до навчання, праці та творчості',
    content: [
      "Ми визнаємо, що кожна людина обов'язково повинна отримати повну загальну середню освіту і також надихаємо віруючих на подальше отримання спеціальної та вищої освіти (Пр. 4:7). Ми визнаємо, що кожна працездатна людина повинна працювати (Ефес. 4:28). Ухилення працездатного віруючого від праці є гріхом безчинства, яке засуджується Божим словом (2 Фес. 3:6-8).",
      'Ми віримо, що людина, створена за образом і подобою Бога-Творця, має здатність творити і реалізовувати цю здатність через творчу, трудову та наукову діяльність, створення творів культури і мистецтва, народної творчості та іншими способами, що не суперечать християнській моралі та етиці, а також нормам права.',
    ],
  },
  {
    title: 'Служба в армії та силових відомствах',
    content: [
      "Ми віримо, що служба у Збройних Силах – обов'язок кожного християнина, як громадянина України (Рим. 13:1,4,7).",
      "Також вважаємо, що відповідно до Біблії громадяни, які покликані Богом бути священнослужителями, присвятивши своє життя служінню Господу Ісусу Христу та своєму народу (Еф. 4:11-13), мають відстрочку від призову на строкову військову службу згідно із законом України «Про військовий обов'язок і військову службу».",
      "У випадку, якщо виконання військового обов'язку суперечить особистим релігійним переконанням громадянина, виконання цього обов'язку повинно бути замінене альтернативною (не військовою) службою.",
    ],
  },
  {
    title: 'Церква, держава і суспільство',
    content: [
      'Ми визнаємо, що Церква відділена від держави і не є інститутом державної влади, не реалізує державних функцій, а є інститутом влади Божої, духовної (Мтф. 16:18,19; Ін. 18:36) і виконує завдання, покладені на неї Ісусом Христом (див. розділ 5. Церква).',
      'Ми визнаємо, що система державної влади встановлена за волею Божою (Рим. 13:1), і державні службовці є також і Божими слугами, щоб заохочувати тих, хто робить добро, і карати злочинців (Рим. 13:3,4).',
      'Ми віримо, що Церква не відділена від суспільства і має покликання бути «світлом» світу, займати активну громадську позицію з питань моралі та етики в суспільстві, має право реалізовувати її у вигляді мирних зібрань, мітингів та демонстрацій, іншими законними способами, оприлюднювати свою позицію в ЗМІ.',
      "Ми визнаємо, що віруючі люди повинні бути соціально активними, брати участь у всіх сферах життя суспільства, користуватися своїми правами та виконувати свої обов'язки, як громадяни України.",
      'Виконуючи свої завдання, Церква, стосовно держави, керується заповіддю Ісуса Христа: «Віддавайте кесарю кесареве, а Боже Богові» (Мтф. 22:21).',
      "Проповідь Євангелія, що супроводжується благодійністю, є невід'ємною частиною життя Церкви. Згідно з Писанням ми покликані бути поряд з нужденними, хворими, служити пригніченим (Мт. 25:34-41, Гал. 2:10), допомагати сиротам і вдовам (Як. 1:27).",
      'Ми покликані до миру і вважаємо неприпустимою будь-яку ворожнечу на гендерному, расовому, етнічному, соціальному, політичному, релігійному та економічному ґрунті.',
      'Ми покликані створювати, поширювати та зберігати мир усіма доступними нам законними засобами і способами (Рим. 14:19; Мт. 5:9).',
    ],
  },
];

const refs = {
  list: document.getElementById('creed-list'),
  loadMore: document.querySelector('.creed-load-more-btn'),
};

let currentPage = 1;
let itemsPerMobPage = 2;
let itemsPerPage = 4;

function setItemsPerPage() {
  if (window.innerWidth < 834) {
    itemsPerPage = itemsPerMobPage;
  } else {
    itemsPerPage = 4;
  }
}

window.addEventListener('resize', () => {
  currentPage = 1;
  setItemsPerPage();
  updateLoadMoreButton();
  updatePagination();
});

function displayCreeds() {
  const startIndex = (currentPage - 1) * itemsPerPage;
  const endIndex = startIndex + itemsPerPage;
  const currentCreeds = creeds.slice(startIndex, endIndex);

  if (currentPage === 1) {
    refs.list.innerHTML = '';
  }

  currentCreeds.forEach(creed => {
    const creedElement = document.createElement('li');
    creedElement.innerHTML = `<h3 class="creed-title">${creed.title}</h3>`;

    if (creed.content) {
      creed.content.forEach(paragraph => {
        creedElement.innerHTML += `<p class="creed-text">${paragraph}</p>`;
      });
    }

    if (creed.sections) {
      creed.sections.forEach(section => {
        creedElement.innerHTML += `<h4 class="creed-subtitle">${section.subtitle}</h4>`;
        section.content.forEach(paragraph => {
          creedElement.innerHTML += `<p class="creed-text">${paragraph}</p>`;
        });
      });
    }

    if (creed.subtitle) {
      const subtitle = document.createElement('h4');
      subtitle.classList.add('creed-subtitle');
      subtitle.textContent = creed.subtitle;
      creedElement.appendChild(subtitle);
    }

    if (creed.list) {
      const ul = document.createElement('ul');
      creed.list.forEach(item => {
        const li = document.createElement('li');
        li.classList.add('creed-item');
        li.textContent = item;
        ul.appendChild(li);
      });
      creedElement.appendChild(ul);
    }

    refs.list.appendChild(creedElement);
  });

  updateLoadMoreButton();
  updatePagination();
}

function updatePagination() {
  const pagination = document.getElementById('pagination');
  pagination.innerHTML = '';

  const totalPages = Math.ceil(creeds.length / itemsPerPage);

  for (let i = 1; i <= totalPages; i++) {
    const pageLink = document.createElement('div');
    pageLink.classList.add('page-link');
    pageLink.textContent = i;
    pageLink.onclick = () => {
      currentPage = i;
      refs.list.innerHTML = '';
      displayCreeds();
      window.scrollTo({ top: 680, behavior: 'smooth' });
    };
    if (i === currentPage) {
      pageLink.classList.add('page-active');
    }
    pagination.appendChild(pageLink);
  }
}

function updateLoadMoreButton() {
  const totalPages = Math.ceil(creeds.length / itemsPerMobPage);

  if (currentPage >= totalPages || window.innerWidth >= 834) {
    refs.loadMore.style.display = 'none';
  } else {
    refs.loadMore.style.display = 'block';
  }
}

refs.loadMore.addEventListener('click', () => {
  currentPage++;
  displayCreeds();
});

setItemsPerPage();
displayCreeds();
